Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་དགོད་ ཀྱིས་ དེ་སྐད་ སྨྲས་ ནས །_ རང་ གི་ བརྩོན་འགྲུས་ ཆེན་པོ་ དང་ སྟོབས་ ཀྱིས་ དྲེགས་པ །_ བློ་གྲོས་ ཤིན་ཏུ་ རྒྱ་ཆེ་བ །_ རང་ གི་ སྟོབས་ དང་ གཞན་ གྱི་ སྟོབས་ ཚད་མ་ གྲངས་ སུ་ མི་ རྩི་བ ར་ རང་ གི་ གནས་ ནས་ ཆས་ ནས་ གནས་ གཞན་ གསུམ་ པར་ འགྲོ་བ ར་ བྱེད་ དེ
en: $206 “With great vigor, strong confidence, vast intelligence, and without any regard for the level of his own strength relative to that of others, the asura ruler Overjoyed will then leave his own asura realm and travel to the third level.

source: གྲོང་ཁྱེར་ ཟབ་པ་ ན་ ལྷ་མ་ ཡིན་ གྱི་ བདག་པོ་ མེ་ཏོག་ ཕྲེང་ ལྷ་མ་ ཡིན་ བྱེ་བ་ ཁྲག་ཁྲིག་ དུ་མ་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས་ བརྩམས་ [28a] པ འི་ ཡིད་ ཀྱིས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ ལ་ སྨྲས་པ །_
en: In the city of Profound,#242 he will go before the asura ruler Puṣpamāla, who reigns over many trillions of asuras. [28.a] With a fervent mind, he will say the following words:

source: འདི་ལྟར་ ཀླུ འི་ རྒྱལ་པོ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ དང་ །_ ལྷ་ དང་ བཅས་པ་ དག་ ལས་ རྒྱལ་བ ར་ བྱ་ ཡིས་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་འགྱེད་ པར་ འདོང་ འདོང་ །_
en: ‘Takṣaka, Vāsuki, and other such nāga kings must be defeated! The asuras shall march forth into battle!’

source: དེ་སྐད་ སྨྲས་པ་ དང་ །_ མེ་ཏོག་ ཕྲེང་ དེས་ སྨྲས་པ །_
en: $207 “To this Puṣpamāla will reply,

source: འདི་ལྟར་ གཡུལ་འགྱེད་པ་ འདི་ ནི་ བདག་ཅག་ གི་ དུས་ མ་ ཡིན་ ཏེ །_
en: ‘The time has not yet come for us to wage battle.

source: མར་ འཛིན་པ་ དང་ །_ ཕ ར་ འཛིན་པ་ དང་ །_ རིགས་ ཀྱི་ རྒན་རབས་ ལ་ རིམ་གྲོ་ བྱེད་པ་ དང་ །_
en: People respect their mothers and fathers, and they respect their elders.

source: དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ་ དང་ །_ ཆོས་ ལ་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ དག་ ཡོད་པ ས །_
en: They respect mendicants and brahmins, and they practice the Dharma.

source: ལྷ འི་ ཕྱོགས་ སྟོབས་ ཆེ་ སྟེ དེ་ལྟ་བས་ན་ དེ་རིང་ བདག་ཅག་ གི་ གཡུལ་འགྱེད་པ འི་ དུས་ མ་ ཡིན་ ནོ་ ཞེས་ སྨྲས་ སོ །_།
en: The forces of the gods are therefore strong, so today is not the right time for us to go to war.’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་ སྤྲོ་ དེ འི་ ཚིག་མ་ མཉན་པ ར་
en: $208 “In response to this unpleasant message, the asura king Overjoyed will reply,

source: འདི་ལྟར་ ཀླུ་ དང་ ལྷ་ དེ་དག་ བདག་ གཅིག་པུ ས་ ཕམ་པ ར་ བྱ་བ ར་ ནུས་ ན །_ ཁྱེད་ དང་ བཅས་པ ས་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ དགོས་ ཏེ །_ ཕམ་པ ར་ བྱ་ ཡིས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དག་ འདོང་ འདོང་ ཞེས་ སྨྲས་ སོ །_།
en: ‘I could defeat those nāgas and gods single-handedly, so if you also come along, they will surely fall. Therefore, let the asura kings march forth!’

source: དེ་ནས་ མེ་ཏོག་ ཕྲེང་ ཞེས་ བྱ་བ་ དེས་ སྤྲོ་བ་ བསྐྱེད་ ནས །_ ལྷ་མ་ ཡིན་ གྱི་ སྡེ་ བྱེ་བ་ ཕྲག་ དུ་མ་ དང་ ལྷན་ཅིག་ གནས་ གཞན་ གཉིས་པ་ ག་ལ་ བ་ དེར་ དོང་ ངོ་ །_།
en: $209 “Inspired by those words, Puṣpamāla will now join ranks with an army of many millions of asuras and together they will proceed to the second level.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ལ་ རབ་ སྤྲོ་ དང་ །_ བརྟན་པ་ དང་ །_ མེ་ཏོག་ ཕྲེང་ དག་ གིས་ ལྷ་ རྣམས་ ལས་ རྒྱལ་བ ར་ བྱ་ ཡིས །_
en: Overjoyed, Firm, and Puṣpamāla will proceed to call upon the asura ruler Rāhu:

source: ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་འགྱེད་ པར་ འདོང་ འདོང་ ཞེས་ སྨྲས་ སོ །_།
en: ‘We shall defeat the gods! Let the asuras march into battle!’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ གྱིས་ དེ་དག་ ལ་ སྨྲས་པ །_
en: $210 “In reply the asura ruler Rāhu will say,

source: ཀྱེ་མ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དག་ དུས་ ལ་མ་ བབ་ སྟེ །_
en: ‘Alas, rulers of the asuras, the time has not yet come.

source: བདག་ཅག་ གི་ གཡུལ་འགྱེད་པ འི་ དུས་ མ་ ཡིན་ ནོ །_།
en: It is not time for us to wage war.

source: འཛམ་བུ འི་ གླིང་ གི་ མི་ རྣམས་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་ སྟེ །_
en: In Jambudvīpa people are righteous and follow the Dharma.

source: མར་ འཛིན་པ་ དང་ །_ ཕ ར་ འཛིན་པ་ དང་ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ འི་ སྐྱེ་དགུ་ དག་ ལྷ་ཡུལ་ དུ་ སྐྱེ་ ལ །_ ལྷ འི་ ཕྱོགས་ སྟོབས་ ཆེ་བ ས་ གཡུལ་འགྱེད་ པར་ མི་ ནུས་ ཏེ
en: They respect their mothers, their fathers, mendicants, and brahmins. When such people die, they are reborn as gods, and in this way the gods have become so powerful that we cannot defeat them.

source: ལྷ་མ་ ཡིན་ གྱི་ དུས་ མ་ ཡིན་ ནོ་ ཞེས་ སྨྲས་ སོ །_།
en: The time of the asuras has not yet come.’

source: དེ་ནས་ ཐམས་ཅད་ ཡིད་ འཐུན་ པར་ ལྷ་མ་ ཡིན་ སྒྲ་གཅན་ དེ་ ལ་ འདི་སྐད་ ཅེས་
en: “However, all the others will unanimously declare,

source: འདི་ལྟར་ བདག་ཅག་ ལྷ་ རྣམས་ དང་ གཡུལ་འགྱེད་ པར་ སྤྲོ་ ཡིས་ འདོང་ འདོང་ ཞེས་ སྨྲས་ སོ །_།
en: ‘We eagerly anticipate that war with the gods. Let us march!’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ དེ་དག་ གི་ བསམ་པ་ དང་ འཐུན་ [28b] པར་ རྒྱ་མཚོ འི་ ནང་ ནས་ ཆས་ ནས་ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ ལ་སོགས་པ་ ག་ལ་ བ་ དེར་ སོང་ སྟེ །_
en: $211 “In accord with those sentiments, the asura ruler Rāhu [28.b] will proceed to enter the ocean and hasten to the realms of Pramatha and other such nāga kings.

source: འདི་ལྟར་ བདག་ཅག་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ འདི་དག་ ཐམས་ཅད་ དང་ འོངས་ ཏེ །_
en: There, he will tell them, ‘We asura kings are on our way!

source: ཀླུ འི་ རྒྱལ་པོ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ ག་ལ་ བ་ དེར་ བདག་ཅག་ གཡུལ་འགྱེད་ དུ་ འོང་ ངོ་ ཞེས་ སྨྲས་ སོ །_།
en: We will wage war on Takṣaka, Vāsuki, and those other nāga kings!’

source: དེ་ནས་ རབ་ འཇོམས་ ཀྱིས་ དེ་ ཐོས་ ནས་ ཡིད་ རབ་ཏུ་ དགའ་ སྟེ །_ འཇོག་པོ་ དང་ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ ག་ལ་ བ་ དེར་ གཡུལ་འགྱེད་པ འི་ ཕྱིར་ འཁོར་ དང་ བཅས་པ་ དོང་ ངོ་ །_།
en: $212 “Hearing this, Pramatha will be overjoyed, and he will therefore join ranks to face Takṣaka, Vāsuki, and the other nāga kings in battle.

source: དེ་ནས་ ཀླུ འི་ བདག་པོ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ ཡང་ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ ལ་སོགས་པ་ གང་ དུ་ གཡུལ་ བཤམས་པ ར་ གཡུལ་འགྱེད་ དུ་ དོང་ ངོ་ །_།
en: Meanwhile, the remaining nāga kings will also prepare for war and proceed to the battlefield.

source: དེ་ནས་ དེ་དག་ དེ་ལྟ ར་ ཕན་ཚུན་ གཡུལ་འགྱེད་པ་ དང་ །_ ཆོས་ དང་ མི་ ལྡན་པ འི་ ཀླུ འི་ བདག་པོ་ རྣམས་ ཕམ་པ ར་ གྱུར་ ཏོ །_།
en: As the war rages, the unrighteous nāga rulers will soon face defeat.

source: དེ་ལྟ ར་ དེ་དག་ ཕམ་པ་ དང་ །_ ལྷ་མ་ ཡིན་ བྱེ་བ་ ཕྲག་ དུ་མ་ དག་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: As they are losing, many millions of asuras will now come racing forward.

source: དེ་ནས་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་ པས་ དེ་དག་ མཐོང་ ནས་ ལྷ་མ་ ཡིན་ ག་ལ་ བར་ འཁོད་པ ར་ གཡུལ་འགྱེད་ དུ་ བརྒྱུགས་ སོ །_།
en: Still, when Takṣaka, Vāsuki, and the others see the advancing army, they will themselves race forth to fight.

source: དེ་ནས་ ཀླུ་ རྣམས་ དང་ །_ ལྷ་མ་ ཡིན་ཚད་ མེད་པ་ དེ་ རྣམས་ རྒྱ་མཚོ འི་ སྟེང་ དུ་ ཕན་ཚུན་ གཡུལ་འགྱེད་ དེ །_
en: At this point, these nāgas and the infinitely numerous asuras will clash at sea.

source: མེ་ཆར་ ལྟར་ འབབ་པ་ དང་ །_ མཚོན་ཆ་ ཆར་ ལྟར་ འབབ་པ་ ཚད་ མེད་པ་ དེ་ དང་ །_ དུག་ནག་པོ་ རྣམ་པར་ གདུངས་ ཤིང་ བློ་ དམན་པ་ དེ་ རྣམས་ ཕན་ཚུན་ གཡུལ་འགྱེད་ དོ །_།
en: As the battle rages, fire and weapons will pour down like a ceaseless rain. This is how those beings who are afflicted by black poison and inferior attitudes wage war upon each other.

source: དེ་ གང་ གི་ ཚེ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ འི་ སྐྱེ་དགུ་ བྱུང་ ན །_ དེ་དག་ ཀླུ་ འབའ་ཞིག་ གིས་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱེད་ དོ །_།
en: $213 “If at that time people are righteous, follow the Dharma, and respect mendicants and brahmins, the nāgas will decisively vanquish the asuras.

source: གལ་ཏེ་ ཤིན་ཏུ་ ཆོས་ དང་ མི་ ལྡན་པ འི་ སྐྱེ་དགུ་ བྱུང་ ན་ དེ འི་ ཚེ་ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ ཀླུ་ རྣམས་ ཕམ་པ ར་ བྱེད་ དོ །_།
en: However, if people are entirely unrighteous, the asuras will defeat the nāgas.

source: གང་ གི་ ཚེ་ ཀླུ་ རྣམས་ ཕམ་པ ར་ འགྱུར་བ་ དེ འི་ ཚེ་ ལྷ་ ཀུན་ ཏུ་ རྒྱུ་བ་ རྣམས་ ལ་ འདི་ལྟར་ ས འི་ འོག་ ན་ གནས་པ་ འདི་དག་ ཐམས་ཅད་ ཀྱིས་ བདག་ཅག་ རྣམ་པ་ ཐམས་ཅད་ དུ་ གཙེས་ ཏེ
en: $214 “When in that way the nāgas have lost the war, they will cry out to the wandering gods, ‘Those subterranean beings have done us harm!

source: དེ་དག་ དང་ བདག་ཅག་ ཕན་ཚུན་ གཡུལ་འགྱེད་ པར་ མི་ ནུས་ ཀྱིས་ རྒྱུགས་ ཤིག་ རྒྱུགས་ ཤིག་ ཅེས་ སྨྲས་ སོ །_།
en: We cannot defeat them in battle, so you must come quickly! You must come quickly!’

source: དེ་ནས་ ལྷ་ ཀུན་ ཏུ་ རྒྱུ་བ་ རྣམས་ མཚོན་ཆ་ དང་ ལག་ཆ་ སྣ་ཚོགས་ ཐོགས་ ཏེ །_ ལྷ་མ་ ཡིན་ [29a] ག་ལ་ འཁོད་པ་ དེར་ འདོང་བ ར་ བྱེད་ དོ །_།
en: “The wandering gods will then take up their various arms and equipment [29.a] and proceed to where the asuras are assembled.

source: དེ་ནས་ ལྷ་ ཀུན་ ཏུ་ རྒྱུ་བ་ རྣམས་ ཀླུ འི་ རྒྱལ་པོ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ ག་ལ་ བ་ དེར་ དོང་ སྟེ་ ཕྱིན་ ནས །_ ཀླུ་ རྣམས་ ལ་ སྨྲས་པ །_
en: $215 “Having gone before Takṣaka, Vāsuki, and other such nāga kings, the wandering gods will tell them,

source: བདག་ཅག་ རྣམས་ ལྷ་མ་ ཡིན་ ཚར་ གཅད་པ འི་ ཕྱིར་ འདིང་ འོངས་ ཏེ །_ བདག་ཅག་ ཁྱེད་ ཀྱིས་ བསྒྲུབས་པ་ ལྷ་མ་ ཡིན་ གཞིག་པ འི་ ཕྱིར་ འདི་ཉིད་ དུ་ འོངས་ སོ །_།
en: ‘Today we have come to destroy the asuras. Join us in our endeavor to crush them.’

source: དེ་སྐད་ ཅེས་ སྨྲས་པ་ དང་ །_ དེ་ནས་ ཡང་ ཀླུ་ རྣམས་ ལྷ་ དང་ ལྷན་ཅིག་ ཏུ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ག་ལ་བ་ དེར་ དོང་ ངོ་ །_།
en: $216 “At this time, the nāgas and the gods will together proceed to where the asura ruler Rāhu dwells.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ དེ་དག་ དེ་ལྟ ར་ མཐོང་ ནས །_ དེ་ནས་ ཡང་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ གཡུལ་འགྱེད་ དུ་ དོང་ ངོ་ །_། དེ་ནས་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ རྒྱ་མཚོ འི་ ནང་ དུ་ གཡུལ་འགྱེད་ པར་ འགྱུར་ ཏེ །_
en: As the asuras see them, they will rush forth to attack, and the gods and asuras will wage battle at sea.

source: གང་ གི་ ཚེ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ འབྱུང་བ་ དེ འི་ ཚེ་ ལྷ་ ཀུན་ ཏུ་ རྒྱུ་བ་ རྣམས་ ཀྱིས་ མྱུར་ དུ་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱེད་ དོ །_།
en: If at that time humans are righteous and follow the Dharma, the wandering gods will soon defeat the asuras.

source: དེ་ནས་ ལྷ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱས་ ནས །_ དེ་ནས་ ཡང་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ གྱི་ གནས་ ག་ལ་བ་ དེར་ དོང་ ངོ་ །_།
en: Defeated, the asuras will then retreat to the residence of the asura ruler Rāhu.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གནས་ གཞན་ གཉིས་པ་ ན་ གནས་པ་ དེ་དག་ རང་ གི་ ཕྱོགས་ མངོན་པར་ བཅོམ་པ་ མངོན་དུ་ མཐོང་ ནས །_
en: $217 “When the asuras who inhabit the second level see that their forces have been vanquished, they will say,

source: བདག་ཅག་ འདི་ ན་ གཡུལ་འགྱེད་ པར་ འཁོད་ ན་ ལྷ་མ་ ཡིན་ རྣམས་ ཅིའི་ཕྱིར་ འབྲོས །_ ལྷ་མ་ ཡིན་ རྣམས་ ཅིའི་ཕྱིར་ འབྲོས་ ཞེས་ སྨྲས་ སོ །_།
en: ‘Why do the asuras flee when we line up for battle? Why do the asuras flee?’

source: དེ་ནས་ ཡང་ ལྷ་མ་ ཡིན་ རྣམས་ གཡུལ་འགྱེད་ དུ་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_། དེ་ནས་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ རྒྱ་མཚོ འི་ དབུས་ སུ་ ཕན་ཚུན་ མངོན་པར་ གནོད་པ འི་ གཡུལ་ ཆེན་པོ་ འཁྲུགས་པ་ བཀྱེ་བ ར་ གྱུར་ ཏོ །_།
en: They will then race forth to meet the gods in battle, and a terribly destructive war will rage between the gods and the asuras in the middle of the ocean.

source: དེ་ནས་ གང་ གི་ ཚེ་ ལྷ་ རྣམས་ རྒྱལ་བ་ དེ འི་ ཚེ་ ལྷ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ གྱི་ དཔུང་ མངོན་པར་ བཅོམ་ མོ །_།
en: When the gods emerge victorious, they will completely crush the asura army.

source: དེ འི་ ཚེ་ འཇིགས་ པས་ བསྐོར་བ འི་ ས་ ན་ གནས་པ འི་ ལྷ་མ་ ཡིན་ རྣམས་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ འདོང་བ ར་ བྱེད་ དོ །_།
en: $218 “At that moment, the asuras who live upon the earth, finding themselves surrounded by terror, will also come forth to face the gods.

source: དེ་ནས་ ལྷ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ གྱི་ དཔུང་ མི་བཟད་པ་ དེ་དག་ མངོན་པར་ མཐོང་ ནས་ འཁོད་ དོ །_།
en: As the gods see the terrifying asura army, they will assemble for battle.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ རྣམས་ ཡང་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ གཡུལ་འགྱེད་ དུ་ དོང་ སྟེ །_ ཕན་ཚུན་ གཡུལ་ ཆེན་པོ་ དེ་དག་ བཀྱེ་བ ར་ གྱུར་ ཏོ །_།
en: The asuras will then march on the gods, and a great battle will rage back and forth.

source: དེ་ནས་ གང་ གི་ ཚེ་ ལྷ་ རྣམས་ ཕམ་པ ར་ གྱུར་པ་ དེ འི་ ཚེ་ འཇིག་རྟེན་ སྐྱོང་བ་ དག་ ལྷ་ ལག་ [29b] ན་ཡོལ་ གོ་ ཐོགས་པ་ དག་ ག་ལ་བ་ དེར་ དོང་ སྟེ །_ འདི་ལྟར་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ བདག་ཅག་ མངོན་པར་ གཙེས་ ཀྱིས་ རྒྱུགས་ ཤིག་ རྒྱུགས་ ཤིག་ ཅེས་ སྨྲས་ སོ །_།
en: If at that time the gods are defeated, the guardians of the world [29.b] will journey to the land of the vessel-bearer gods, bringing them the message,

source: དེ་ ཐོས་ ནས་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ དག་ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ གཡུལ་འགྱེད་ དུ་ དོང་ ངོ་ །_།
en: ‘The gods have done us harm. You must rush forth! You must rush forth!’

source: དེ་ནས་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ མཚོན་ཆ་ དང་ །_ ལག་ཆ་ སྣ་ཚོགས་ ཅན་ དག་ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ དོང་ ངོ་ །_།
en: $219 “In retaliation, the vessel-bearer gods will sally forth to meet the asuras in battle, brandishing their various arms and equipment.

source: དེ་ནས་ ལྷ་ དེ་དག་ མངོན་པར་ མཐོང་ ནས །_ ཡང་ ལྷ་མ་ ཡིན་ རྣམས་ ཁྲོས་ ནས་ བརྒྱུགས་ སོ །_།
en: When the asuras see the gods, they will become infuriated and launch an attack.

source: དེ་ནས་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ རྣམས་ དང་ །_ ལྷ་མ་ ཡིན་ དེ་ རྣམས་ ཕན་ཚུན་ སྤུ་ ཟིང་ ཞེས་ བྱེད་པ འི་ གཡུལ་ ཆེན་པོ་ བཀྱེ་བ་ དང་ །_ འདི་ལྟར་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་ འདི་ ལྟ་བུ་ མཚུངས་པ་ མེད་པ་ བཀྱེའོ་ ཞེས་ དེ་དག་ མངོན་པར་ བརྗོད་ དོ །_།
en: The gods and asuras will then fight what is called the hair-raising battle, a conflict unlike any other.

source: དེ་དག་ གང་ གི་ ཚེ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ སྐྱེ་དགུ་ དག་ འབྱུང་བ་ དེ འི་ ཚེ་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱེད་ དེ
en: $220 “If the people are righteous and follow the Dharma, the vessel-bearer gods will triumph over the asuras.

source: དེ འི་ ཚེ་ རྒྱ་མཚོ འི་ དབུས་ སུ་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ ཤིན་ཏུ་ འཇོམས་པ་ ཆོས་ དང་ ཆོས་མ་ ཡིན་པ་ ལ་ རྟེན་པ འི་ རྟགས་ ཅན་ དུ་ གྱུར་པ་ དག་ ན །_ གཞན་ དང་ མི་ འདྲ་བ འི་ གཡུལ་ བཀྱེའོ །_།
en: Thus, as they fight this extremely destructive battle in the middle of the ocean, it is a war between Dharma and non-Dharma, a battle unlike any other.

source: གང་ གི་ ཚེ་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ དེ་དག་ ཕམ་པ ར་ གྱུར་པ་ དེ འི་ ཚེ་ འཇིག་རྟེན་ སྐྱོང་བ་ རྣམས་ ལྷ་ ཕྲེང་ཐོགས་ དག་ ག་ལ་བ་ དེར་ དོང་ སྟེ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ མཛོད་ ཅིག་ ཅེས་ སྨྲས་པ་ དང་ །_
en: $221 “If the vessel-bearer gods should lose that battle, the guardians of the world will go before the garland-bearer gods and demand of them, ‘Defeat the asuras!’

source: ལྷ་མ་ ཡིན་ དེ་ རྣམས་ ལ་ མངོན་པར་ བརྟགས་ ནས །_ ལྷ་ ཕྲེང་ཐོགས་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: Having investigated the asuras, the garland bearers will then rush to assistance.

source: ལྷ་ ཀུན་ ཏུ་ རྒྱུ་བ་ དང་ །_ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ དང་ །_ ལྷ་ ཕྲེང་ཐོགས་ དེ་ རྣམས་ ཀྱང་ ཕྱོགས་ གཅིག་ ཏུ་ གྱུར་ ཅིང་ །_ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ ཡང་ གཅིག་ ཏུ་ འདུས་ སོ །_།
en: Thus, the wandering gods, the vessel bearers, and the garland bearers will unite and join forces with Takṣaka, Vāsuki, and the others.

source: ལྷ་མ་ ཡིན་ སྒྲ་གཅན་ གྱི་ ས་པ་ དང་ །_ གྲོང་ཁྱེར་ འོད་ལྡན་ ན་ གནས་པ་ དང་ །_ གཉིས་ ཤིང་ རྩེ་བ་ དང་ །_ གནས་ གཉིས་པ་ ན་ གནས་པ་ དང་ །_། མགུལ་ ཕྲེང་ དག་ སྟེ །_
en: On the opposing side the asuras of the realm of Rāhu, the city of Radiant, Double Pleasure, and the second level, as well as the ‘necklaces,’ will gather.

source: བྱེ་བ་ ཁྲག་ཁྲིག་ གྲངས་མེད་པ་ དུ་མ་ ཕྱོགས་ གཅིག་ ཏུ་ གྱུར་པ་ དང་ གཡུལ་ ཆེན་པོ་ བཀྱེ་ སྟེ །_
en: In this way, many billions of asuras will unite to fight.

source: གང་ གི་ ཚེ་ དེ་དག་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ བྱུང་བ་ དེ འི་ ཚེ །_ ལྷ འི་ ཕྱོགས་ ནི་ རྒྱལ་བ ར་ འགྱུར་ ལ །_ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ནི་ ཕམ་པ ར་ འགྱུར་ ཏེ [30a]
en: $222 “If at that time the people are righteous and follow the Dharma, the gods will be victorious and the asuras will be defeated. [30.a]

source: ཆོས་ ལ་ རྟེན་པ་ ཤིན་ཏུ་ ལེགས་པ ར་ འགྱུར་ ན །_ ཆོས་ ལ་ མི་ རྟེན་པ་ ལྟ་ ག་ལ་ ཞིག་ འགྱུར །_། གང་ གི་ ཚེ་ དེ་དག་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ་ བྱུང་བ་ དེ འི་ ཚེ་ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ རྒྱལ་བ ར་ འགྱུར་ རོ །_།
en: Therefore, when people rely on the Dharma, everything will turn out well, but how could that ever be the case if people do not rely on the Dharma?

source: ལྷ་མ་ ཡིན་ གྱི་ དཔུང་ དེ་དག་ འཇིག་རྟེན་ སྐྱོང་བ་ རྣམས་ ཀྱིས་ མངོན་པར་ མཐོང་ ནས་ ལྷ་ རྟག་ ཏུ་ མྱོས་ གནས་ ག་ལ་བ་ དེར་ དོང་ སྟེ །_
en: If people are unrighteous and do not follow the Dharma, the forces of the asuras will triumph. In that case, when the guardians of the world have witnessed the asura army, they will go before the ever-infatuated gods and say,

source: ལྷ་ དག་ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ རྣམས་ རྒྱལ་བ ར་ གྱུར་ གྱིས་ རྒྱུགས་ ཤིག་ རྒྱུགས་ ཤིག་ ཅེས་ སྨྲས་ སོ །_།
en: ‘Gods, the forces of the asuras have won, and so you must now rush forth! You must rush forth!’

source: དེ་ ཐོས་ ནས་ ལྷ་ རྟག་ ཏུ་ མྱོས་ གནས་ དག་ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ག་ལ་བ་ དེར་ མངོན་པར་ འཇོམས་ སུ་ དོང་ སྟེ །_
en: $223 “Having received this message, the ever-infatuated gods will come forth to crush the asuras.

source: མཚོན་ཆ་ དང་ ལག་ཆ་ སྣ་ཚོགས་ ཐོགས་པ འི་ ཚོགས་ འབུམ་ཕྲག་ དུ་མ་ དག་ རྒྱ་མཚོ འི་ ནང་ ན་ གནས་པ་ ག་ལ་བ་ དེར་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ ཧ་ ཧ འི་ སྒྲ་ ཕྱུང་ ནས་
en: Brandishing their weapons and equipment, many hundreds of thousands of them will head to sea to defeat the asuras.

source: རིངས་པ ར་ མངོན་པར་ འཇོམས་པ ར་ བྱེད་ ཅིང་ །_ རྣམ་པར་ འཇོམས་པ ར་ བྱེད་པ་ གནོད་པ་ དུ་མ་ བྱེད་པ་ དེ་དག་ ཕན་ཚུན་ གཡུལ་ མི་བཟད་པ་ ཆེན་པོ་ བཀྱེའོ །_།
en: With terrifying laughter, they will surge into action and, as the two sides clash in a horrifying battle, much destruction and harm will ensue.

source: དེ་ནས་ གང་ གི་ ཚེ་ ལྷ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱས་པ་ ན །_ དེ་དག་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ག་ལ་བ་ དེར་ དོང་ ངོ་ །_།
en: $224 “If at that time the gods are victorious over the asuras, the latter will retreat to the realm of the asura ruler Rāhu.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ གྱིས་ ལྷ་མ་ ཡིན་ དེ་དག་ ལ་ འདི་སྐད་ ཅེས་ ཁྱེད་ཅག་ གི་ དཔུང་ དུ་ བདག་ཅག་ གནས་ ན །_
en: However, Rāhu, ruler of the asuras, will tell them,

source: གྲོགས་པོ་ དག་ཅི་ སྟེ་ འབྲོས །_ ཅི་སྟེ་ འབྲོས །_
en: ‘Friends, why would you flee as long as we are in your army? Why would you flee?

source: ལྷ་ དག་ ཉུང་ ཞིང་ འདི་དག་ ཁྱེད་ཅག་ ལས་ ལྷག་པ་ མེད་ ལ །_ འདི་དག་ ནི་ བརྩོན་འགྲུས་ ཆུང་ སྟེ །_
en: The gods are few and no better than you. They have little endurance so we can still defeat them.

source: བདག་ཅག་ གིས་ ལྷ་ རྣམས་ ཕམ་པ ར་ བྱ་ ཡིས །_ དེ་ལྟ་བས་ན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དག་ སླར་ ལོག་ ཤིག་ ཅེས་ སྨྲས་ སོ །_།
en: Therefore, lords of asuras, return! Return!’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ལས་ དེ་སྐད་ ཐོས་ ནས །_ ལྷ་མ་ ཡིན་ དག་ ལྷ་ རྣམས་ དང་ གཡུལ་འགྱེད་ དུ་ ཕྱིར་ལོག་ གོ །_། དེ་ནས་ ཡང་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ དེ་དག་ མཚོན་ཆ་ འདེབས་པ་ འཁྲུགས་པ འི་ རྣམ་པ་ དུ་མ འི་ གཡུལ་འགྱེད་ པར་ བྱེད་ དེ །_
en: $225 “When they hear these orders from the asura ruler Rāhu, the asuras will return to fight the gods, and thus the gods and asuras will continue to raise arms and wage a vicious war against each other.

source: དེ འི་ ཚེ་ལྷ་མ་ ཡིན་ གནས་ གཉིས་པ་ ན་ གནས་པ་ གཉིས་ ཤིང་ རྩེ་བ་ དང་ གནས་ གསུམ་པ་ ན་ གནས་པ་ མགུལ་ ཕྲེང་ གི་ རིས་ སུ་ གཏོགས་པ་ ཐམས་ཅད་ ལྷ་ དང་ གཡུལ་འགྱེད་ པར་ ཕྱིར་ལོག་ གོ །_།
en: All the asuras of the second level, of Double Pleasure, of the third level, and of the necklace class will then return to fight the gods.

source: དེ་དག་ གང་ གི་ ཚེ །_ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་ [30b] པ འི་ སྐྱེ་དགུ་ བྱུང་བ་ དེ འི་ ཚེ །_ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ཀྱིས་ ལྷ འི་ ཕྱོགས་ ཕམ་པ ར་ བྱེད་ དོ །_།
en: $226 “If at that time people are unrighteous and do not follow the Dharma, [30.b] the asuras will defeat the gods.

source: གལ་ཏེ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ སྐྱེ་དགུ་ དག་ བྱུང་ ན །_ ལྷ འི་ ཕྱོགས་ དེ་དག་ གིས་ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ཕམ་པ ར་ བྱེད་ དེ །_
en: Yet if people are righteous and follow the Dharma, the gods will conquer the asuras.

source: དེ་ལྟ ར་ ལྷ་ རྣམས་ ནི་ ཆོས་ ཀྱི་ གཙོ་བོ །། ཆོས་ ཀྱི་ རྒྱལ་མཚན །_ ཆོས་ ལ་ གཞོལ་བ་ ཡིན་ ནོ །_།
en: Thus, the gods are Dharma leaders; they are banners of the Dharma and patrons of the Dharma.

source: ལྷ་མ་ ཡིན་ དེ་དག་ ཐམས་ཅད་ ནི་ ཆོས་ དང་ མི་ ལྡན་པ །_ ཆོས་མ་ ཡིན་པ་ ལ་ རྟེན་པ །_ ཆོས་ ཀྱིས་ སྐྱོབ་པ་ མ་ ཡིན་ ནོ །_།
en: The asuras all lack the Dharma; they rely on non-Dharma and are not protected by the Dharma.

source: དེ་ནས་ ལྷ་ རྣམས་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ །_
en: $227 “At this point, the gods will think,

source: ཀྱེ་མ་ ལྷ་མ་ ཡིན་ འདི་དག་ གིས་ བདག་ཅག་ ལ་ དེ་ལྟ ར་ གཙེ་བ ར་ ཅི་སྟེ་ གནས །_
en: ‘How could the asuras inflict any harm upon us?

source: འདི་དག་ ནི་ བདག་ཅག་ ལས་ ཁྱད་ ཞུགས་པ་ ཡང་ མེད་ ལ །_ མཚུངས་པ་ ཡང་ མ་ ཡིན་ ནོ །_།
en: They are not our superiors, nor are they even our equals.

source: འཛམ་བུ འི་ གླིང་ ན་ ཡང་ ད་དུང་ དུ་མ ར་ འཛིན་པ་ དང་ །_ ཕ ར་ འཛིན་པ་ དང་ །_ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ དང་ །_
en: In Jambudvīpa, people still respect their mothers and fathers, and they are righteous and follow the Dharma.

source: རྒན་རབས་ ལ་ རིམ་གྲོ་ བྱེད་པ་ དང་ །_
en: They serve their elders.

source: གསོ་སྦྱོང་ ལ་ཉེ་ བར་གནས་པ་ དང་ །_
en: They maintain their training and practice.

source: སྦྱིན་པ་ དག་ ཀྱང་ སྦྱིན །_ བསོད་ནམས་ དག་ ཀྱང་ བྱེད །_ བག་ ཡོད་པ་ ལ་ བག་ ཡོད་པར་ གནས་པ འི་ མི་ དག་ ཡོད་ དེ །_
en: They are generous, create merit, and are duly conscientious.

source: དེ་ལྟ ར་ བག་ ཡོད་པ་ ལ་ བག་ ཡོད་པར་ གནས་པ་ དེ་དག་ འཆི་བ འི་ དུས་བྱ ས་ ནས་ ལྷ་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ ར་ འགྱུར་ ཏེ །_
en: When these beings who are duly conscientious die, they will be reborn among the gods.

source: ལྷ་མ་ ཡིན་ གྱི་ ཆོས་ འཕེལ་བ་ དང་ །_ ཆོས་འབྱུང་ བར་ ནི་ མི་ འགྱུར་ རོ་ སྙམ་ མོ །_།
en: Hence, there is no way for the traditions of the asuras to spread or thrive.’

source: དེ་དག་ གིས་ དེ་ལྟ ར་ རིག་ ནས་ ཀུན་ ཏུ་ རྒྱུ་བ་ དང་ །_ ཕྲེང་ཐོགས་ དང་ །_ ཀུན་ དི་པ་ ཀ་ དང་ །_ རྟག་ ཏུ་ མྱོས་པ འི་ ལྷ་ རྣམས་ ཆོས་ ཀྱི་ རྒྱལ་མཚན་ ཁྱེར་ ཏེ །_ ལྷ་མ་ ཡིན་ གྱི་ དཔུང་ ག་ལ་བ་ དེར་ ལྷ་ དེ་དག་ ཐམས་ཅད་ རེག་ མ་ཐོགས་པ ར་ རྒྱུག་པ ར་ བྱེད་ ཅིང་ འདི་ལྟར་ ལྷ་མ་ ཡིན་ རྣམས་
en: $228 “With this insight, the wandering gods, the garland bearers,#243 and the ever-infatuated gods will raise the victory banner of the Dharma and then storm down on the asura army, shouting,

source: སྡོད་ ཅིག _། སྡོད་ ཅིག _། ཁྱེད་ཅག་ གིས་ ངེད་ རྣམས་ ལ་ ཅིའི་ཕྱིར་ གཙེ །_
en: ‘Stop! Stop! Why do you pester us?

source: ངེད་ ཅག་ ལས་ ཁྱེད་ ཀྱི་ དཔུང་ ཁྱད་ ཞུགས་པ་ ཡང་ མེད །_ གཙོ་བོ་ ཡང་ མ་ ཡིན །_ མཚོན་ཆ་ ཡང་ མི་ མང་བ ས་ ངེད་ ཅག་ འདི་ རྣམས་ ནི་ ཁྱེད་ རྣམས་ གཞོམ་པ འི་ ཕྱིར་ ལྷགས་པ་ ཡིན་ གྱིས །_ ཡང་ ས འི་ འོག་ ཏུ་ མ་ འགྲོ་ ཤིག _།
en: Your army is no better than ours, you are not our superiors, and you do not have any more weapons than us. We are all set to demolish you, so do not walk into this abyss!

source: མངོན་པར་ གཙེ་བ ར་ བྱེད་པ འི་ བློ་ ཅན་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ་ འདི་དག་ ཐམས་ཅད་ ལ་ བདེ་བ འམ་ མྱ་ངན་ ལས་ འདས་པ་ མེད་ དོ །_། དེ་སྐད་ ཅེས་ སྨྲས་ ནས །_
en: Aggressors who are unrighteous and who do not follow the Dharma will never find happiness or be free from pain!’

source: ཀླུ་ ནོར་ [31a] རྒྱས་ ཀྱི་ བུ་ དང་ །_ འཇོག་པོ་ ལ་སོགས་པ་ དང་ ལྷན་ཅིག་ དེ་དག་ ཐམས་ཅད་ དང་ བདག་ཉིད་ ཐམས་ཅད་ ལས་ མཚོན་ཆ་ དང་ །_ ལག་ཆ་ ཆར་ ལྟར་ འབེབས་ ཤིང་ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ འདོང་བ ར་ བྱེད་ དོ །_།
en: [31.a] Thus, joining forces with the nāgas such as Vāsuki and Takṣaka, they will charge toward the asuras and let a rain of weapons and military implements pour down on them.

source: དེ་ནས་ ཀླུ་ རྣམས་ ཀྱང་ མེ་ རབ་ཏུ་ འབར་བ་ ཆར་ ལྟར་ འབེབས་ ཤིང་ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_། དེ་ནས་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ ཀྱང་ ཀླུ་ དེ་དག་ ལ་ མངོན་པར་ བརྟགས་ ནས །_ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ འི་ ཀླུ་ རབ་ འཇོམས་ ལ་སོགས་པ་ ལ །_
en: $229 “The asuras will proceed to examine the nāgas and will say to Pramatha and the other nāga kings who are unrighteous and do not follow the Dharma,

source: འདི་ལྟར་ ཁྱེད་ ཀྱང་ བདག་ཅག་ གི་ ཕྱོགས་ ཡིན་ གྱིས །_ ཀླུ འི་ རྒྱལ་པོ་ ནོར་ རྒྱས་ ཀྱི་ བུ་ དང་ །_ འཇོག་པོ་ ལ་སོགས་པ་ ག་ལ་ བ་ དེར་ ཀླུ་ རྣམས་ དང་ གཡུལ་འགྱེད་ དུ་ རྒྱུགས་ ཤིག་ ཅེས་ བསྒོའོ །_།
en: ‘You belong to our side, so come forth and wage war on the nāga kings Vāsuki, Takṣaka, and so on.’
